In [1]:
import pandas as pd

In [2]:
date_list = [{'date': '2000-06-27'},
         {'date': '2002-09-24'},
         {'date': '2005-12-20'}]
df = pd.DataFrame(date_list, columns = ['date'])
df

         date
0  2000-06-27
1  2002-09-24
2  2005-12-20

In [3]:
def f(date):
    return date.split('-')[0]

In [4]:
df['year'] = df['date'].map(f)

In [5]:
df

         date  year
0  2000-06-27  2000
1  2002-09-24  2002
2  2005-12-20  2005

map은 값을 숫자로 바꿀 수 있음

In [6]:
school_id_list = [{'name': 'John', 'job': "teacher", 'age': 40},
                {'name': 'Nate', 'job': "teacher", 'age': 35},
                {'name': 'Yuna', 'job': "teacher", 'age': 37},
                {'name': 'Abraham', 'job': "student", 'age': 10},
         ]
df = pd.DataFrame(school_id_list, columns = ['name', 'job', 'age'])

In [7]:
df

      name      job  age
0     John  teacher   40
1     Nate  teacher   35
2     Yuna  teacher   37
3  Abraham  student   10

In [8]:
df.job = df.job.map({'student' : 0, 'teacher' : 1})

In [9]:
df

      name  job  age
0     John    1   40
1     Nate    1   35
2     Yuna    1   37
3  Abraham    0   10

applymap는 모든 값을 바꾸는 것

In [11]:
x_y = [{'x' : 5.5, 'y' : -5.6},
       {'x' : 2.1, 'y' : -2.6},
       {'x' : 0.3, 'y' : 1.4}
      ]
df = pd.DataFrame(x_y)

In [12]:
df

     x    y
0  5.5 -5.6
1  2.1 -2.6
2  0.3  1.4

In [13]:
import numpy as np

In [14]:
df = df.applymap(np.around)

In [15]:
df

     x    y
0  6.0 -6.0
1  2.0 -3.0
2  0.0  1.0